
function showLocation(location) {
    var locationImage = document.getElementById('location-image');
    var locationDescription = document.getElementById('location-description');
    
    switch(location) {
        case 'Парк':
            locationImage.src = "jpg/парк.jpg";
            locationDescription.innerText = "Парк на території університету - це мальовнича територія з деревами, квітами та альтанками, де можна відпочити та насолодитися природою. Відкритий для всіх і майже завжди. ";
            break;
        case 'Фонтан':
            locationImage.src = "jpg/фонтан.jpg";
            locationDescription.innerText = "Фонтан у парку університету - улюблене місце для студентів. Це невеликий, але чарівний об'єкт, де вода лагідно шепоче, а бризки освіжають у спекотні дні. Тут студенти збираються, щоб відпочити, поговорити та насолодитися природою. Фонтан став невід'ємною частиною студентського життя, місцем, де заряджаються енергією та натхненням перед наступними заняттями ";
            break;     
        case 'Вхід до ліцею':
            locationImage.src = "jpg/ліцей.jpg";
            locationDescription.innerText = "Вхід до Херсонського академічного ліцею ім.О.В.Мішукова";
            break;
        case 'Центральна площа':
            locationImage.src = "jpg/центр.jpg";
            locationDescription.innerText = "Головна площа університету - це центральне місце на території університету, де проводяться різні заходи та заходи.";
            break;
        case 'Спортивний майданчик':
            locationImage.src = "jpg/спорт.jpg";
            locationDescription.innerText = "Спортивний майданчик для молоді. Тут студенти та прості відвідувачі можуть позайматися спортом, тут є все необхідне для цього, потрібно лише бажання) ";
            break;   
        case 'Дитячий майданчик':
            locationImage.src = "jpg/дитячий майданчик.jpg";
            locationDescription.innerText = "Дитячий майданчик в якому можуть гуляти діти зі своєю сім'єю в дозволений час університетом. ";
            break;
        case 'Пам`ятний меморіал':
            locationImage.src = "jpg/меморіал.jpg";
            locationDescription.innerText = " Пам`ятний меморіал - це вічна відзнака та визнання внеску видатних особистостей, які стали важливою складовою історії та духу університету. Цей меморіал не лише втілює в собі пам'ять про цих видатних людей, але й слугує джерелом натхнення для сучасних студентів та факультету. Він є символом пошани та вдячності за їхні досягнення та вклад у розвиток університетської спільноти. Меморіал нагадує про значущість їхнього спадку та залишається вічним джерелом інспірації для майбутніх поколінь, що проходитимуть стежинами цієї престижної установи. ";
            break;
        case 'Вхід до Херсонського Деражвного Університету ':
            locationImage.src = "jpg/вхідхду.jpg";
            locationDescription.innerText = "Вхід в університет - це портал до навчального світу, який відкривається перед студентами, викладачами та відвідувачами. Цей вхід, будь то головний арка або двері з символічними елементами, вражає своєю величчю та архітектурною вишуканістю. Крім того, він відображає дух університету, його цінності та завдання. Пройшовши через ці порти, люди занурюються у навчальне середовище, де вони зможуть розвивати свої знання, розширювати свій світогляд та поглиблювати розуміння світу навколо себе. Вхід в будівлю університету стає першим кроком у величезному світі освіти та відкриває двері до безмежних можливостей навчання та саморозвитку.";
            break;   
        case 'Вхід до навчально-лабораторного комплексу ХДУ №5':
            locationImage.src = "jpg/комплекс.jpg";
            locationDescription.innerText = "Головний вхід до Навчально-лабораторного комплексу ХДУ №5";              
            break;       
    }
}


function goToHome() {
    window.location.href = "index.html";
}

